OpenNuvoton/M55M1BSP/Library/StdDriver/src/qspi.c
/**************************************************************************//**
 * @file     qspi.c
 * @version  V1.00
 * @brief    QSPI driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup QSPI_Driver QSPI Driver
  @{
*/

/** @addtogroup QSPI_EXPORTED_FUNCTIONS QSPI Exported Functions
  @{
*/
#define QSPI_CONFIG_TIMEOUT     (0x100000UL)

static int32_t QSPI_IsValidModule(const QSPI_T *qspi)
{
    return ((qspi == QSPI0) || (qspi == QSPI1)) ? 1 : 0;
}

static int32_t QSPI_IsValidMasterSlave(uint32_t u32MasterSlave)
{
    return ((u32MasterSlave == QSPI_MASTER) || (u32MasterSlave == QSPI_SLAVE));
}

static int32_t QSPI_IsValidMode(uint32_t u32QSPIMode)
{
    return ((u32QSPIMode == QSPI_MODE_0) || (u32QSPIMode == QSPI_MODE_1)
            || (u32QSPIMode == QSPI_MODE_2) || (u32QSPIMode == QSPI_MODE_3));
}

/* Set PCLK as the clock source of QSPI */
static void QSPI_SetPCLKSrc(const QSPI_T *qspi)
{
    if (!QSPI_IsValidModule(qspi))
    {
        return;
    }

    if (qspi == QSPI0)
    {
        CLK->QSPISEL = (CLK->QSPISEL & ~(CLK_QSPISEL_QSPI0SEL_Msk)) | (CLK_QSPISEL_QSPI0SEL_PCLK0);
    }
    else
    {
        CLK->QSPISEL = (CLK->QSPISEL & ~(CLK_QSPISEL_QSPI1SEL_Msk)) | (CLK_QSPISEL_QSPI1SEL_PCLK2);
    }
}

/* Get the PCLK clock frequency of QSPI */
static uint32_t QSPI_GetPCLKSrcFreq(const QSPI_T *qspi)
{
    uint32_t u32RetValue = 0UL;

    if (!QSPI_IsValidModule(qspi))
    {
        return 0UL;
    }

    if (qspi == QSPI0)
    {
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else
    {
        u32RetValue = CLK_GetPCLK2Freq();
    }

    return u32RetValue;
}

/**
 * @brief Get QSPI Clock Source Frequency.
 *
 * @param qspi      The pointer of the specified QSPI module.
 * @return uint32_t Clock Frequency
 */
static uint32_t QSPI_GetModuleClkSrcFrq(const QSPI_T *qspi)
{
    uint32_t u32QSPIClkSrcSel = 0UL;
    uint32_t u32RetValue = 0UL;

    if (!QSPI_IsValidModule(qspi))
    {
        return 0UL;
    }

    /* Get QSPI clock source selection */
    if (qspi == QSPI0)
    {
        u32QSPIClkSrcSel = ((CLK->QSPISEL & CLK_QSPISEL_QSPI0SEL_Msk) >> CLK_QSPISEL_QSPI0SEL_Pos);
    }
    else if (qspi == QSPI1)
    {
        u32QSPIClkSrcSel = ((CLK->QSPISEL & CLK_QSPISEL_QSPI1SEL_Msk) >> CLK_QSPISEL_QSPI1SEL_Pos);
    }
    else
    {
        u32QSPIClkSrcSel = QSPI_CLKSRC_HXT;
    }

    switch (u32QSPIClkSrcSel)
    {
        case QSPI_CLKSRC_PLL:
            u32RetValue = (CLK_GetAPLL0ClockFreq() >> 1);   /* Clock source is APLL0 */
            break;

        case QSPI_CLKSRC_PCLK:
            u32RetValue = QSPI_GetPCLKSrcFreq(qspi);        /* Clock source is PCLK */
            break;

        case QSPI_CLKSRC_HIRC:
            u32RetValue = __HIRC;                           /* Clock source is HIRC 12Mhz */
            break;

        case QSPI_CLKSRC_HIRC48M:
            u32RetValue = ((uint32_t)__HIRC48M / 4U);       /* Clock source is HIRC 48Mhz / 4 */
            break;

        case QSPI_CLKSRC_HXT:
        default:
            u32RetValue = __HXT;                            /* Clock source is HXT */
            break;
    }

    return u32RetValue;
}

static int32_t QSPI_WaitDisableReady(const QSPI_T *qspi)
{
    uint32_t u32Timeout = QSPI_CONFIG_TIMEOUT;

    if (!QSPI_IsValidModule(qspi))
    {
        return QSPI_ERR_FAIL;
    }

    while ((((qspi->STATUS & QSPI_STATUS_QSPIENSTS_Msk) != 0U) ||
            ((qspi->STATUS & QSPI_STATUS_BUSY_Msk) != 0U)) &&
            (u32Timeout > 0U))
    {
        u32Timeout--;
    }

    return (u32Timeout == 0U) ? QSPI_ERR_TIMEOUT : QSPI_OK;
}

static int32_t QSPI_EnterConfigMode(QSPI_T *qspi, uint32_t *pu32WasEnabled)
{
    if ((!QSPI_IsValidModule(qspi)) || (pu32WasEnabled == (uint32_t *)NULL))
    {
        return QSPI_ERR_FAIL;
    }

    *pu32WasEnabled = qspi->CTL & QSPI_CTL_QSPIEN_Msk;

    if (*pu32WasEnabled != 0U)
    {
        qspi->CTL &= ~QSPI_CTL_QSPIEN_Msk;
        return QSPI_WaitDisableReady(qspi);
    }

    return QSPI_OK;
}

static void QSPI_ExitConfigMode(QSPI_T *qspi, uint32_t u32WasEnabled)
{
    if (u32WasEnabled != 0U)
    {
        qspi->CTL |= QSPI_CTL_QSPIEN_Msk;
    }
}

/**
  * @brief  This function make QSPI module be ready to transfer.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32MasterSlave Decides the QSPI module is operating in master mode or in slave mode. (QSPI_SLAVE, QSPI_MASTER)
  * @param[in]  u32QSPIMode Decides the transfer timing. (QSPI_MODE_0, QSPI_MODE_1, QSPI_MODE_2, QSPI_MODE_3)
  * @param[in]  u32DataWidth Decides the data width of a QSPI transaction.
  * @param[in]  u32BusClock The expected frequency of QSPI bus clock in Hz.
  * @return Actual frequency of QSPI peripheral clock.
  * @details By default, the QSPI transfer sequence is MSB first, the slave selection signal is active low and the automatic
  *          slave selection function is disabled.
    *          In Slave mode, the u32BusClock shall be 0U and the QSPI clock divider setting will be 0.
  *          The actual clock rate may be different from the target QSPI clock rate.
  *          For example, if the QSPI source clock rate is 12 MHz and the target QSPI bus clock rate is 7 MHz, the
  *          actual QSPI clock rate will be 6MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, QSPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= QSPI peripheral clock source, DIVIDER will be set to 0.
  * @note   In slave mode, the QSPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t QSPI_Open(QSPI_T *qspi, uint32_t u32MasterSlave, uint32_t u32QSPIMode, uint32_t u32DataWidth, uint32_t u32BusClock)
{
    uint32_t u32RetValue = 0UL;

    if (!QSPI_IsValidModule(qspi) ||
            !QSPI_IsValidMasterSlave(u32MasterSlave) ||
            !QSPI_IsValidMode(u32QSPIMode))
    {
        return 0UL;
    }

    qspi->CTL &= ~QSPI_CTL_QSPIEN_Msk;

    if (QSPI_WaitDisableReady(qspi) != QSPI_OK)
    {
        return 0UL;
    }

    /* Default setting: slave selection signal is active low.
       In Master mode, disable the automatic slave selection function. */
    qspi->SSCTL = QSPI_SS_ACTIVE_LOW;

