OpenNuvoton/M55M1BSP/Library/StdDriver/src/qspi.c
    /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 0. */
    qspi->CTL = (u32QSPIMode | u32MasterSlave);
    QSPI_SET_DATA_WIDTH(qspi, u32DataWidth);

    if (u32MasterSlave == QSPI_MASTER)
    {
        /* Set the bus clock for the QSPI module and store the actual frequency in u32RetValue. */
        u32RetValue = QSPI_SetBusClock(qspi, u32BusClock);
    }
    else     /* For slave mode, force the QSPI peripheral clock rate to equal APB clock rate. */
    {
        /* Force slave peripheral clock source back to PCLK. */
        QSPI_SetPCLKSrc(qspi);

        /* Set DIVIDER = 0 */
        qspi->CLKDIV = 0UL;

        /* Get the PCLK clock frequency of QSPI */
        u32RetValue = QSPI_GetPCLKSrcFreq(qspi);
    }

    qspi->CTL |= QSPI_CTL_QSPIEN_Msk;

    return u32RetValue;
}

/**
  * @brief  Disable QSPI controller.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will reset QSPI controller.
  */
void QSPI_Close(const QSPI_T *qspi)
{
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (!QSPI_IsValidModule(qspi))
    {
        return;
    }

    /* Unlock protected registers */
    if (u32RegLockLevel)
    {
        SYS_UnlockReg();
    }

    /* Reset QSPI */
    if (qspi == QSPI0)
    {
        SYS->QSPIRST |= SYS_QSPIRST_QSPI0RST_Msk;
        SYS->QSPIRST &= ~SYS_QSPIRST_QSPI0RST_Msk;
    }
    else
    {
        SYS->QSPIRST |= SYS_QSPIRST_QSPI1RST_Msk;
        SYS->QSPIRST &= ~SYS_QSPIRST_QSPI1RST_Msk;
    }

    /* Lock protected registers */
    if (u32RegLockLevel)
    {
        SYS_LockReg();
    }
}

/**
  * @brief  Clear RX FIFO buffer.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will clear QSPI RX FIFO buffer. The RXEMPTY (QSPI_STATUS[8]) will be set to 1.
  */
void QSPI_ClearRxFIFO(QSPI_T *qspi)
{
    if (!QSPI_IsValidModule(qspi))
    {
        return;
    }

    qspi->FIFOCTL |= QSPI_FIFOCTL_RXFBCLR_Msk;
}

/**
  * @brief  Clear TX FIFO buffer.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will clear QSPI TX FIFO buffer. The TXEMPTY (QSPI_STATUS[16]) will be set to 1.
  * @note The TX shift register will not be cleared.
  */
void QSPI_ClearTxFIFO(QSPI_T *qspi)
{
    if (!QSPI_IsValidModule(qspi))
    {
        return;
    }

    qspi->FIFOCTL |= QSPI_FIFOCTL_TXFBCLR_Msk;
}

/**
  * @brief  Disable the automatic slave selection function.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @details This function will disable the automatic slave selection function and set slave selection signal to inactive state.
  */
void QSPI_DisableAutoSS(QSPI_T *qspi)
{
    uint32_t u32WasEnabled = 0UL;

    if (QSPI_EnterConfigMode(qspi, &u32WasEnabled) != QSPI_OK)
    {
        return;
    }

    qspi->SSCTL &= ~(QSPI_SSCTL_AUTOSS_Msk | QSPI_SSCTL_SS_Msk);

    QSPI_ExitConfigMode(qspi, u32WasEnabled);
}

/**
  * @brief  Enable the automatic slave selection function.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32SSPinMask Specifies slave selection pins. (QSPI_SS)
  * @param[in]  u32ActiveLevel Specifies the active level of slave selection signal. (QSPI_SS_ACTIVE_HIGH, QSPI_SS_ACTIVE_LOW)
  * @details This function will enable the automatic slave selection function. Only available in Master mode.
  *          The slave selection pin and the active level will be set in this function.
  */
void QSPI_EnableAutoSS(QSPI_T *qspi, uint32_t u32SSPinMask, uint32_t u32ActiveLevel)
{
    uint32_t u32WasEnabled = 0UL;

    if (QSPI_EnterConfigMode(qspi, &u32WasEnabled) != QSPI_OK)
    {
        return;
    }

    qspi->SSCTL = (qspi->SSCTL & (~(QSPI_SSCTL_AUTOSS_Msk | QSPI_SSCTL_SSACTPOL_Msk | QSPI_SSCTL_SS_Msk))) |
                  ((u32SSPinMask & QSPI_SSCTL_SS_Msk) | (u32ActiveLevel & QSPI_SSCTL_SSACTPOL_Msk) | QSPI_SSCTL_AUTOSS_Msk);

    QSPI_ExitConfigMode(qspi, u32WasEnabled);
}

/**
  * @brief  Set the QSPI bus clock.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32BusClock The expected frequency of QSPI bus clock in Hz.
  * @return Actual frequency of QSPI bus clock.
  * @details This function is only available in Master mode. The actual clock rate may be different from the target QSPI bus clock rate.
  *          For example, if the QSPI source clock rate is 12 MHz and the target QSPI bus clock rate is 7 MHz, the actual QSPI bus clock
  *          rate will be 6 MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, QSPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= QSPI peripheral clock source, DIVIDER will be set to 0.
  */
uint32_t QSPI_SetBusClock(QSPI_T *qspi, uint32_t u32BusClock)
{
    uint32_t u32ClkSrc = 0UL;
    uint32_t u32HCLKFreq = 0UL;
    uint32_t u32RetValue = 0UL;
    uint32_t u32WasEnabled = 0UL;

    if (!QSPI_IsValidModule(qspi))
    {
        return 0UL;
    }

    if (QSPI_EnterConfigMode(qspi, &u32WasEnabled) != QSPI_OK)
    {
        return QSPI_GetBusClock(qspi);
    }

    /* Get system clock frequency */
    u32HCLKFreq = CLK_GetSCLKFreq();

    if (u32BusClock >= u32HCLKFreq)
    {
        /* Select PCLK as the clock source of QSPI */
        QSPI_SetPCLKSrc(qspi);
    }

    /* Get clock source of QSPI */
    u32ClkSrc = QSPI_GetModuleClkSrcFrq(qspi);

    if (u32BusClock >= u32HCLKFreq)
    {
        /* Set DIVIDER = 0 */
        qspi->CLKDIV = 0UL;
        /* Return master peripheral clock rate */
        u32RetValue = u32ClkSrc;
    }
    else if (u32BusClock >= u32ClkSrc)
    {
        /* Set DIVIDER = 0 */
        qspi->CLKDIV = 0UL;
        /* Return master peripheral clock rate */
        u32RetValue = u32ClkSrc;
    }
    else if (u32BusClock == 0U)
    {
        /* Set DIVIDER to the maximum value. f_qspi = f_qspi_clk_src / (DIVIDER + 1) */
        qspi->CLKDIV = (qspi->CLKDIV & ~QSPI_CLKDIV_DIVIDER_Msk) | QSPI_CLKDIV_DIVIDER_Msk;
        /* Return master peripheral clock rate */
        u32RetValue = (u32ClkSrc / ((QSPI_CLKDIV_DIVIDER_Msk >> QSPI_CLKDIV_DIVIDER_Pos) + 1U));
    }
    else
    {
        uint32_t u32Div = 0UL;

