OpenNuvoton/M55M1BSP/Library/StdDriver/src/qspi.c
    if (u32Mask & QSPI_FIFO_RXOV_INT_MASK)
    {
        u32ClearMask |= QSPI_STATUS_RXOVIF_Msk; /* Clear RX overrun interrupt flag */
    }

    if (u32Mask & QSPI_FIFO_RXTO_INT_MASK)
    {
        u32ClearMask |= QSPI_STATUS_RXTOIF_Msk; /* Clear RX time-out interrupt flag */
    }

    if (u32ClearMask != 0UL)
    {
        qspi->STATUS = u32ClearMask;
    }
}

/**
  * @brief  Get QSPI status.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32Mask The combination of all related sources.
  *                     Each bit corresponds to a source.
  *                     This parameter decides which flags will be read. It is combination of:
  *                       - \ref QSPI_BUSY_MASK
  *                       - \ref QSPI_RX_EMPTY_MASK
  *                       - \ref QSPI_RX_FULL_MASK
  *                       - \ref QSPI_TX_EMPTY_MASK
  *                       - \ref QSPI_TX_FULL_MASK
  *                       - \ref QSPI_TXRX_RESET_MASK
  *                       - \ref QSPI_QSPIEN_STS_MASK
  *                       - \ref QSPI_SSLINE_STS_MASK
  *
  * @return Flags of selected sources.
  * @details Get QSPI related status specified by u32Mask parameter.
  */
uint32_t QSPI_GetStatus(const QSPI_T *qspi, uint32_t u32Mask)
{
    uint32_t u32Flag = 0UL;
    uint32_t u32Status = 0UL;

    if (!QSPI_IsValidModule(qspi))
    {
        return 0UL;
    }

    u32Status = qspi->STATUS;

    /* Check busy status */
    if ((u32Mask & QSPI_BUSY_MASK) && ((u32Status & QSPI_STATUS_BUSY_Msk) != 0U))
    {
        u32Flag |= QSPI_BUSY_MASK;
    }

    /* Check RX empty flag */
    if ((u32Mask & QSPI_RX_EMPTY_MASK) && ((u32Status & QSPI_STATUS_RXEMPTY_Msk) != 0U))
    {
        u32Flag |= QSPI_RX_EMPTY_MASK;
    }

    /* Check RX full flag */
    if ((u32Mask & QSPI_RX_FULL_MASK) && ((u32Status & QSPI_STATUS_RXFULL_Msk) != 0U))
    {
        u32Flag |= QSPI_RX_FULL_MASK;
    }

    /* Check TX empty flag */
    if ((u32Mask & QSPI_TX_EMPTY_MASK) && ((u32Status & QSPI_STATUS_TXEMPTY_Msk) != 0U))
    {
        u32Flag |= QSPI_TX_EMPTY_MASK;
    }

    /* Check TX full flag */
    if ((u32Mask & QSPI_TX_FULL_MASK) && ((u32Status & QSPI_STATUS_TXFULL_Msk) != 0U))
    {
        u32Flag |= QSPI_TX_FULL_MASK;
    }

    /* Check TX/RX reset flag */
    if ((u32Mask & QSPI_TXRX_RESET_MASK) && ((u32Status & QSPI_STATUS_TXRXRST_Msk) != 0U))
    {
        u32Flag |= QSPI_TXRX_RESET_MASK;
    }

    /* Check QSPIEN flag */
    if ((u32Mask & QSPI_QSPIEN_STS_MASK) && ((u32Status & QSPI_STATUS_QSPIENSTS_Msk) != 0U))
    {
        u32Flag |= QSPI_QSPIEN_STS_MASK;
    }

    /* Check QSPIx_SS line status */
    if ((u32Mask & QSPI_SSLINE_STS_MASK) && ((u32Status & QSPI_STATUS_SSLINE_Msk) != 0U))
    {
        u32Flag |= QSPI_SSLINE_STS_MASK;
    }

    return u32Flag;
}

/** @} end of group QSPI_EXPORTED_FUNCTIONS */
/** @} end of group QSPI_Driver */
/** @} end of group Standard_Driver */
